title: Intro
---
More portable vaporware?
Heck yeah!
This time on the playdate!
<<jump DemoSelect>>
===

title: DemoSelect
---

-> Options Test
    <<jump OptionsTest>>
-> Markup Test (wip)
    <<jump MarkupTest>>
-> Command Test (wip)
    <<jump CommandTest>>
-> Expression Test
    <<jump ExpressionTest>>    
-> Detour Test
    <<jump DetourTest>>

<<jump DemoSelect>>

===


title: OptionsTest
---
This is an options test.
-> Option 1
    This is option 1.
-> Option {1 + 1}
    This is option 2.
-> Option {$test_variable}
    This is option {$test_variable}.
<<jump DemoSelect>>
===

title: MarkupTest
---
This is a test of markup
Hey look! [plural value={1} one="A pie" other="Some pies" /]!
Hey look! [plural value={2} one="A pie" other="Some pies" /]!
I just baked [plural value={3} one="a pie" other="% pies" /]!
Is this [bold]bold[/bold]?
Is this [italic]italic[/italic]?
someguy: Here's a character line. 
This has a tag #todo
This has a tag with a value #anothertag:3
<<jump DemoSelect>>
===

title: CommandTest
---
Let's see if commands work.
Press [italic]A[/italic] to wait for 5 seconds
<<wait  5>>
Did that work?
Now let's try some custom commands
(see console for output)
Static arguments test
<<test_command 1 2 3>>
Math arguments test
<<test_command {1 + 2} {3 * 4} {5 / 2}>>
Variable argument test
<<declare $test_variable = 42>>
<<test_command {$test_variable}>>
string arguments test
<<test_command "This is a test string" "Part 2">>
string argumentment with escape characters test
<<test_command "This is a \"test string\" " "with some" "'escape' characters">>
neat!
<<jump DemoSelect>>
===
 
title: ExpressionTest
---
1 + 2 = {1 + 2}
1 - 2 = {1 - 2}
1.5 ** 3 = {1.5 * 3}
4 / 2 = {4 / 2}
3 % 2 = {3 % 2}
1 > 2 = {1 > 2}
1 < 2 = {1 < 2}
1 >= 2 = {1 >= 2}
1 <= 2 = {1 <= 2}
1 is 4 = {1 is 4}
"test" eq "blag" = {"test" eq "blag"}
"a" + "b" = {"a" + "b"}
4 neq 5 = {4 neq 5}
true or false = {true or false}
true xor false = {true xor false}
not true = {not true }
true and false = {true and false}

<<jump DemoSelect>>
===


title: DetourTest
---
I'm about to detour
<<detour DetourTestPt2>>
Back from the detour!
<<jump DemoSelect>>
===

title: DetourTestPt2
---
I'm inside the detour.
===